---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry
source: html/71d66cd5-6dae-22f0-f364-838e13cfbf8e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry

Contains one entry of intermediate colors in color settings for analysis display style.

## Syntax (C#)
```csharp
public class AnalysisDisplayColorEntry : IDisposable
```